{
  "backend/main.mo": "Motoko canister implementing user profiles, product catalog, and order management with access control.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files.",
  "frontend/index.css": "Tailwind base styles and OKLCH theme variables defining light and dark mode palettes.",
  "frontend/index.html": "HTML entry point loading the React app root and main module.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, and global toaster.",
  "frontend/src/components/brand/BrandLogo.tsx": "Renders the VUURIX logo image with optional sizing.",
  "frontend/src/components/design/Price.tsx": "Formats bigint currency amounts into USD display text.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper with header, footer, and routed content outlet.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with brand info, navigation links, social icons, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with logo, navigation links, cart indicator, and mobile menu.",
  "frontend/src/components/store/ProductCard.tsx": "Displays a clickable product card with image, name, category, and price, navigating to the product detail page.",
  "frontend/src/components/store/ProductImage.tsx": "Renders a product image with fallback placeholders and error handling.",
  "frontend/src/components/store/QuantityControl.tsx": "Provides plus/minus buttons to adjust item quantity within set bounds.",
  "frontend/src/components/system/ErrorState.tsx": "Shows an error alert with optional retry button.",
  "frontend/src/components/system/LoadingState.tsx": "Displays a centered loading spinner with an optional message.",
  "frontend/src/hooks/mutations/useCreateOrder.ts": "Mutation hook that creates an order via the actor and invalidates the order list cache.",
  "frontend/src/hooks/queries/useOrder.ts": "Fetches a single order by ID using the actor with query conditions and no retries.",
  "frontend/src/hooks/queries/useProduct.ts": "Queries a single product by ID with a 5‑minute stale time.",
  "frontend/src/hooks/queries/useProducts.ts": "Queries the full product list with a 5‑minute stale time.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and helpers using Internet Identity, loading identities and handling login/logout.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with item list, quantity controls, totals, and empty‑state handling.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements checkout flow with authentication prompts, shipping form, order submission, and success navigation.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero banner and a featured product grid with loading and error states.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details including items and total, with loading/error handling.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product details page with image, options, quantity, and add‑to‑cart logic plus loading/error states.",
  "frontend/src/pages/ShopPage.tsx": "Shop listing page with category filtering, product grid, and loading/error UI.",
  "frontend/src/state/cart.ts": "Zustand store managing cart items, quantities, persistence, and totals.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, and plugins.",
  "project_state.json": "Stores the current VUURIX project state, including versions, image needs, implemented features, and pending feature requests. Defines project metadata and planned backend models/APIs for products and orders."
}