{
  "backend/main.mo": "Core backend canister with user profiles, admin-gated product CRUD, and user-gated order creation and retrieval using AccessControl.",
  "backend/migration.mo": "Placeholder migration module that returns state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components with test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across the app.",
  "frontend/index.css": "Tailwind CSS base layer defining color tokens, themes, and global styles.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and global providers including theming and toasts.",
  "frontend/src/components/brand/BrandLogo.tsx": "Simple component rendering the VUURIX logo image.",
  "frontend/src/components/design/Price.tsx": "Formats bigint price values into USD currency strings.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout with header, main outlet, and footer.",
  "frontend/src/components/layout/SiteFooter.tsx": "Page footer with branding, links, social icons, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with navigation, cart icon, mobile menu, and conditional admin link.",
  "frontend/src/components/store/ProductCard.tsx": "Displays a product card with image, category, name, price, and navigates to the product page on click.",
  "frontend/src/components/store/ProductImage.tsx": "Renders a product image with a fallback placeholder based on a hash and handles image load errors.",
  "frontend/src/components/store/QuantityControl.tsx": "Shows increment/decrement buttons with limits to adjust a numeric quantity.",
  "frontend/src/components/system/ErrorState.tsx": "Displays an error alert with a message and optional retry button.",
  "frontend/src/components/system/LoadingState.tsx": "Shows a centered loading spinner with an optional message.",
  "frontend/src/hooks/mutations/useAddProduct.ts": "Mutation hook to add a product via the actor and refresh the product list with success/error toasts.",
  "frontend/src/hooks/mutations/useCreateOrder.ts": "Mutation hook to create an order and invalidate the orders query.",
  "frontend/src/hooks/mutations/useDeleteProduct.ts": "Mutation hook to delete a product and refresh the product list with toast notifications.",
  "frontend/src/hooks/mutations/useUpdateProduct.ts": "Mutation hook to update a product and refresh the product list with toast feedback.",
  "frontend/src/hooks/queries/useIsCallerAdmin.ts": "Checks if the current actor identity is an admin with caching and no retries.",
  "frontend/src/hooks/queries/useOrder.ts": "Fetches a single order by ID using the actor.",
  "frontend/src/hooks/queries/useProduct.ts": "Fetches a single product by ID with caching and stale‑time settings.",
  "frontend/src/hooks/queries/useProducts.ts": "Fetches the full product list using the actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, state management, and persisted identity loading.",
  "frontend/src/index.css": "Defines Tailwind layers and custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin interface for viewing, creating, editing, and deleting products with forms, dialogs, and product list management.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls, removal, and a summary, showing an empty state when no items exist.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles order creation with form validation, authentication checks, and cart submission, showing login and empty-cart states as needed.",
  "frontend/src/pages/HomePage.tsx": "Renders a hero banner and featured products with loading and error states, linking users to the shop.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order details and totals after purchase, with loading/error states and navigation options.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays product details with size/color selectors, quantity, and add-to-cart handling with validation.",
  "frontend/src/pages/ShopPage.tsx": "Lists all products with category filtering, handling loading and error states.",
  "frontend/src/state/cart.ts": "Defines a persisted Zustand store for cart items with add, remove, update, total, and count utilities.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based query cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom fonts, colors, layout settings, and plugins.",
  "project_state.json": "Project state file describing VUURIX features, versions, and metadata for build tracking."
}