{
  "kind": "build_request",
  "title": "Add admin Product Upload & Management panel",
  "projectName": "VUURIX",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Add an admin-only Product Upload & Management page that lets an admin create, edit, and delete products in the VUURIX catalog (fields: name, price, description, category, image, sizes, colors).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-User-Connect-Shopify",
          "msg-User-Upload-Clothes",
          "msg-User-Yes"
        ],
        "quotes": [
          "Do you want me to add a Product Upload page to your VUURIX admin?",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "A new route exists for an admin product management page (e.g., /admin/products) and is reachable via TanStack Router.",
        "The page shows a product list with actions to Create, Edit, and Delete a product.",
        "Create/Edit forms support: name (text), description (multiline), price (number), category (text), sizes (list of strings), colors (list of strings), and an image field.",
        "Submitting Create calls the backend to persist the product and refreshes the product list in the UI.",
        "Submitting Edit updates the product in the backend and refreshes the UI.",
        "Delete removes the product in the backend and refreshes the UI.",
        "If a non-admin user navigates to the admin page, the UI shows a clear English message indicating access is restricted and does not allow product changes."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Support adding product photos from the admin page by allowing either (a) entering an image URL or (b) selecting an image file that is converted to a data URL and stored in the product imageUrl field; show a preview before saving.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-User-Upload-Clothes",
          "msg-User-Yes"
        ],
        "quotes": [
          "How to upload clothes in this website",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "The admin product form provides an input for an image URL and an optional file picker.",
        "When a file is selected, the UI shows an image preview and stores the resulting data URL into the product imageUrl value used on save.",
        "Existing storefront components (product cards and product detail) correctly render newly added product images using the saved imageUrl (http(s) URL or data URL).",
        "If no image is provided, the storefront continues to fall back to existing placeholder behavior."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Expose a simple backend query method that the frontend can use to determine whether the current caller is an admin, so the UI can conditionally show admin navigation entry points and guard admin pages.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-User-Yes"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method that returns a boolean indicating whether the caller is an admin.",
        "Frontend uses this boolean to hide/show admin entry points and to prevent admin actions from being attempted by non-admin users."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add React Query hooks for admin product mutations (add, update, delete) and ensure product list queries are invalidated/refetched after successful mutations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-User-Yes"
        ],
        "quotes": [
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "There are React Query mutation hooks for addProduct, updateProduct, and deleteProduct.",
        "On successful mutation, the products query cache is invalidated and the product list UI updates without a manual page refresh.",
        "Mutation failures show an English error message (toast or inline error) and do not corrupt the UI state."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any frontend immutable paths listed in SYSTEM_CONTEXT; compose those components instead.",
    "Use English for all user-facing UI text.",
    "Do not add Shopify integration as part of this change set."
  ],
  "nonGoals": [
    "Shopify product/order sync or using Shopify as the primary backend.",
    "Public (non-admin) product uploads.",
    "Image hosting/CDN or serving images from the backend; the backend should only store imageUrl text (including data URLs) as part of product data.",
    "Inventory/stock tracking, discount codes, taxes, or shipping rate calculation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}