{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "VUURIX Admin Product Upload & Management (Frontend)",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Add an admin-only product management route with list + create/edit/delete UI guarded by admin status.",
      "acceptanceCriteria": [
        "A new route exists for an admin product management page (e.g., /admin/products) and is reachable via TanStack Router.",
        "The page shows a product list with actions to Create, Edit, and Delete a product.",
        "Create/Edit forms support: name (text), description (multiline), price (number), category (text), sizes (list of strings), colors (list of strings), and an image field.",
        "Submitting Create calls the backend to persist the product and refreshes the product list in the UI.",
        "Submitting Edit updates the product in the backend and refreshes the UI.",
        "Delete removes the product in the backend and refreshes the UI.",
        "If a non-admin user navigates to the admin page, the UI shows a clear English message indicating access is restricted and does not allow product changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new TanStack Router route for /admin/products and wire it into the existing routeTree so it is navigable. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminProductsPage.tsx",
          "operation": "create",
          "description": "Implement the admin product management page UI: show products list, create/edit form, and delete action; guard the entire experience by checking admin status and rendering an English access-restricted message for non-admins (no mutation actions available). Use the selected authorization component’s frontend capability (role-based access control UI patterns) to guide admin gating behavior; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Conditionally add an Admin navigation entry (e.g., 'Admin') that links to /admin/products only when the current caller is an admin; hide it otherwise. Use the selected authorization component’s frontend capability to determine visibility based on role/admin status; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/queries/useIsCallerAdmin.ts",
          "operation": "create",
          "description": "Add a React Query hook that calls the backend admin-check capability (isCallerAdmin) via the actor and returns a boolean for UI guards and conditional navigation. Use the selected authorization component’s frontend capability for handling authorization errors gracefully; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Support product photos in the admin form via image URL or file-to-data-URL with preview, and ensure storefront renders saved imageUrl values with placeholder fallback.",
      "acceptanceCriteria": [
        "The admin product form provides an input for an image URL and an optional file picker.",
        "When a file is selected, the UI shows an image preview and stores the resulting data URL into the product imageUrl value used on save.",
        "Existing storefront components (product cards and product detail) correctly render newly added product images using the saved imageUrl (http(s) URL or data URL).",
        "If no image is provided, the storefront continues to fall back to existing placeholder behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Enhance the create/edit product form to include: (a) image URL input, (b) optional file picker that converts the file to a data URL, stores it into the imageUrl form field, and shows a preview before saving. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/store/ProductImage.tsx",
          "operation": "modify",
          "description": "Ensure ProductImage reliably falls back to existing generated placeholder assets when imageUrl is empty/invalid, while continuing to render any valid http(s) URL or data URL. Update placeholder references to match available generated assets under frontend/public/assets/generated. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Add React Query mutation hooks for admin product add/update/delete with products query invalidation and user-friendly English error handling.",
      "acceptanceCriteria": [
        "There are React Query mutation hooks for addProduct, updateProduct, and deleteProduct.",
        "On successful mutation, the products query cache is invalidated and the product list UI updates without a manual page refresh.",
        "Mutation failures show an English error message (toast or inline error) and do not corrupt the UI state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/mutations/useAddProduct.ts",
          "operation": "create",
          "description": "Create a React Query mutation hook that calls the backend addProduct capability via the actor and invalidates/refetches the ['products'] query on success; surface failures with an English error message (toast or inline). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/mutations/useUpdateProduct.ts",
          "operation": "create",
          "description": "Create a React Query mutation hook that calls the backend updateProduct capability via the actor and invalidates/refetches the ['products'] query on success; surface failures with an English error message. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/mutations/useDeleteProduct.ts",
          "operation": "create",
          "description": "Create a React Query mutation hook that calls the backend deleteProduct capability via the actor and invalidates/refetches the ['products'] query on success; surface failures with an English error message. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Wire the add/update/delete mutation hooks into the admin page actions; on success, reset relevant local form state and rely on query invalidation to refresh the visible product list; on error, keep the UI stable and show an English error message. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}